backend/tests/performance/stress-test.config.yml
# Muud Health — Stress Test Configuration (Artillery)
# © Muud Health — Armin Hoes, MD
#
# Usage: npx artillery run backend/tests/performance/stress-test.config.yml

config:
  target: "{{ $processEnvironment.LOAD_TEST_TARGET }}"
  defaults:
    headers:
      Content-Type: "application/json"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm-up: 10 rps for 60s"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp: 10 → 50 rps over 120s"
    - duration: 300
      arrivalRate: 50
      name: "Stress: sustained 50 rps for 300s"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Peak: 50 → 100 rps for 60s"
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down: 100 → 5 rps"
  ensure:
    p95: 2000
    p99: 5000
    maxErrorRate: 1

scenarios:
  - name: "Health Check"
    weight: 15
    flow:
      - get:
          url: "/health"

  - name: "Authenticated Browse"
    weight: 45
    flow:
      - get:
          url: "/user/me"
          headers:
            Authorization: "Bearer dev-loadtest-user"
      - think: 1
      - get:
          url: "/people/connections"
          headers:
            Authorization: "Bearer dev-loadtest-user"
      - think: 2
      - get:
          url: "/feed"
          headers:
            Authorization: "Bearer dev-loadtest-user"

  - name: "Chat Access"
    weight: 20
    flow:
      - get:
          url: "/chat/conversations"
          headers:
            Authorization: "Bearer dev-loadtest-user"

  - name: "Journal Access"
    weight: 20
    flow:
      - get:
          url: "/journal"
          headers:
            Authorization: "Bearer dev-loadtest-user"